#### Terraform Plan 📖 ####
<details><summary>Show Plan</summary>

```terraform
tailscale_tailnet_key.main: Refreshing state... [id=kANHoGieHD11CNTRL]
data.oci_core_services.all_services: Reading...
data.oci_containerengine_cluster_option.main: Reading...
data.oci_identity_availability_domains.main: Reading...
oci_identity_group.managers: Refreshing state... [id=ocid1.group.oc1..aaaaaaaac7alsg5sta36d66mr4yflfdakygdxxusvnv54km3nznudlyvbaba]
oci_identity_compartment.platform: Refreshing state... [id=ocid1.compartment.oc1..aaaaaaaaxks7l2gcjjk3euzod7mzd22vc6bmczuqtto3f6z3aamcglgy2ujq]
oci_identity_user.manager: Refreshing state... [id=ocid1.user.oc1..aaaaaaaafxpfydig3om5bsydxijntrc64fbbjalgrjybqq6i2eihpjkxpzta]
oci_objectstorage_bucket.state: Refreshing state... [id=n/cnm7patunz1z/b/platform-state]
data.oci_containerengine_cluster_option.main: Read complete after 1s [id=ContainerengineClusterOptionDataSource-1870923232]
oci_core_public_ip.main: Refreshing state... [id=ocid1.publicip.oc1.ap-seoul-1.amaaaaaabsyhd7qafbingjhb7nxqn3qcaowsc7sgyi2trscfa6jzlhu7wvmq]
oci_core_vcn.main: Refreshing state... [id=ocid1.vcn.oc1.ap-seoul-1.amaaaaaabsyhd7qazvdwifpfgn75iw5yxheajr5ng4esmlikj23v7ee2ef3q]
data.oci_core_images.ubuntu: Reading...
oci_identity_policy.cluster: Refreshing state... [id=ocid1.policy.oc1..aaaaaaaagu6nbrnawfhjdwnrkfbzn6smo345m22gzfl55qxvxt7vep4yfqeq]
data.oci_core_services.all_services: Read complete after 1s [id=CoreServicesDataSource-0]
data.oci_identity_availability_domains.main: Read complete after 1s [id=IdentityAvailabilityDomainsDataSource-686890930]
data.oci_identity_fault_domains.main: Reading...
oci_identity_user_group_membership.manager: Refreshing state... [id=ocid1.groupmembership.oc1..aaaaaaaa3mgwk4qef6qpqqgvi7duo7ep6ydxa6ionu4l5gx3vgffqaa3qutq]
oci_identity_policy.manager: Refreshing state... [id=ocid1.policy.oc1..aaaaaaaayhc5xs4li2w3l32btbgwn5bh6om3lyn2y2qiyvcrsebvbno4e6cq]
data.oci_identity_fault_domains.main: Read complete after 0s [id=IdentityFaultDomainsDataSource-2954258040]
oci_core_nat_gateway.main: Refreshing state... [id=ocid1.natgateway.oc1.ap-seoul-1.aaaaaaaap7fljb33jz7xfhnm54leup5owryl6xen4fzgkvnjqdz3dtsoupkq]
oci_core_network_security_group.bastion: Refreshing state... [id=ocid1.networksecuritygroup.oc1.ap-seoul-1.aaaaaaaayquhop5uavha3rpzt4lukx6kdpz6d6wraegzddtzahq4pnlwhzgq]
oci_core_internet_gateway.main: Refreshing state... [id=ocid1.internetgateway.oc1.ap-seoul-1.aaaaaaaaonpjrtiqcayeevrkbiavrrjberaljszeqx3xxucgnczyyn34u4ka]
oci_core_network_security_group.worker: Refreshing state... [id=ocid1.networksecuritygroup.oc1.ap-seoul-1.aaaaaaaaz5y4ozx4tv6f6r3vbymfmwgddettc25rc5w2afrg5libo3o662fq]
oci_core_network_security_group.cluster: Refreshing state... [id=ocid1.networksecuritygroup.oc1.ap-seoul-1.aaaaaaaargvnkigajohw6qvznbzlrdtmivyeaunrlx5dgeqvugie7xywtnea]
oci_core_service_gateway.main: Refreshing state... [id=ocid1.servicegateway.oc1.ap-seoul-1.aaaaaaaa6pdgo7kccqt4r4cs747knrxybmaz2xkcvdaqau6ztjc2rdm3tnba]
data.oci_core_images.ubuntu: Read complete after 1s [id=CoreImagesDataSource-675692870]
oci_core_network_security_group_security_rule.bastion-to-global: Refreshing state... [id=5B12E3]
oci_core_route_table.public: Refreshing state... [id=ocid1.routetable.oc1.ap-seoul-1.aaaaaaaaf4htalzhwrxx4763yptthhd7oxu4schmuv2hq5u32xbi22pygdqq]
oci_core_network_security_group_security_rule.worker-from-worker: Refreshing state... [id=3CF182]
oci_core_network_security_group_security_rule.worker-to-global: Refreshing state... [id=903BB0]
oci_core_network_security_group_security_rule.worker-from-bastion: Refreshing state... [id=DE31C8]
oci_core_network_security_group_security_rule.worker-icmp: Refreshing state... [id=9C1E3C]
oci_core_network_security_group_security_rule.cluster-to-global: Refreshing state... [id=C704C9]
oci_core_network_security_group_security_rule.cluster-from-bastion: Refreshing state... [id=E359DE]
oci_core_network_security_group_security_rule.cluster-from-worker-management: Refreshing state... [id=407CCB]
oci_core_network_security_group_security_rule.cluster-to-worker: Refreshing state... [id=8489A2]
oci_core_network_security_group_security_rule.cluster-from-worker-api: Refreshing state... [id=A3A3FB]
oci_core_network_security_group_security_rule.worker-from-cluster: Refreshing state... [id=804EE8]
oci_core_subnet.public: Refreshing state... [id=ocid1.subnet.oc1.ap-seoul-1.aaaaaaaavvobrlojwajixsampnnqwjpnrwqrp23kp5kfnr3vxqxdluskhafq]
oci_load_balancer_load_balancer.main: Refreshing state... [id=ocid1.loadbalancer.oc1.ap-seoul-1.aaaaaaaatssba24t3l4kozqymaqhubbtif6sx65rdw4begr7nxwedmep46ga]
oci_core_route_table.private: Refreshing state... [id=ocid1.routetable.oc1.ap-seoul-1.aaaaaaaa2gdnpvg6ecx744a63vowlzaagbsqkmbb7wuf2i5lyyilfaesfpmq]
oci_core_subnet.private: Refreshing state... [id=ocid1.subnet.oc1.ap-seoul-1.aaaaaaaaz2zzw7w2kolrxzxelyfpu2lnsa6oths6txnblyewgc7wf3pr6dqq]
tailscale_acl.main: Refreshing state... [id=1b5d5621-19fb-f490-b890-5cba657914cf]
oci_containerengine_cluster.main: Refreshing state... [id=ocid1.cluster.oc1.ap-seoul-1.aaaaaaaav675okbokp7hx5psdy6mt2bstn6zvvgvxvcuipmrvcxsuzj32fmq]
oci_core_instance.bastion: Refreshing state... [id=ocid1.instance.oc1.ap-seoul-1.anuwgljrbsyhd7qcrxmlulolu4tzvap7fgqnkmyhieqcmmbeo6eqktuawniq]
data.oci_containerengine_node_pool_option.main: Reading...
data.oci_containerengine_node_pool_option.main: Read complete after 0s [id=ContainerengineNodePoolOptionDataSource-3381421671]
oci_containerengine_node_pool.main: Refreshing state... [id=ocid1.nodepool.oc1.ap-seoul-1.aaaaaaaan674whrp5r7gjgbl3g3fvvpyfrnrg523vn3cs7vmtnz7pmrrmlia]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # oci_budget_alert_rule.main will be created
  + resource "oci_budget_alert_rule" "main" {
      + budget_id      = (known after apply)
      + defined_tags   = (known after apply)
      + description    = (known after apply)
      + display_name   = (known after apply)
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + message        = (known after apply)
      + state          = (known after apply)
      + threshold      = 1
      + threshold_type = "PERCENTAGE"
      + time_created   = (known after apply)
      + time_updated   = (known after apply)
      + type           = "FORECAST"
      + version        = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # oci_budget_budget.main will be created
  + resource "oci_budget_budget" "main" {
      + actual_spend                          = (known after apply)
      + alert_rule_count                      = (known after apply)
      + amount                                = 1
      + budget_processing_period_start_offset = (known after apply)
      + compartment_id                        = "ocid1.tenancy.oc1..aaaaaaaa5vwe52hngn55vyyitt2xeigrjqsibrlmewnsv2wjo3hnaw55i3aa"
      + defined_tags                          = (known after apply)
      + description                           = (known after apply)
      + display_name                          = (known after apply)
      + end_date                              = (known after apply)
      + forecasted_spend                      = (known after apply)
      + freeform_tags                         = (known after apply)
      + id                                    = (known after apply)
      + processing_period_type                = (known after apply)
      + reset_period                          = "MONTHLY"
      + start_date                            = (known after apply)
      + state                                 = (known after apply)
      + target_compartment_id                 = (known after apply)
      + target_type                           = (known after apply)
      + targets                               = (known after apply)
      + time_created                          = (known after apply)
      + time_spend_computed                   = (known after apply)
      + time_updated                          = (known after apply)
      + version                               = (known after apply)
    }

  # oci_logging_log.load-balancer-access will be created
  + resource "oci_logging_log" "load-balancer-access" {
      + compartment_id     = (known after apply)
      + defined_tags       = (known after apply)
      + display_name       = "platform-log-load-balancer-access"
      + freeform_tags      = (known after apply)
      + id                 = (known after apply)
      + is_enabled         = (known after apply)
      + log_group_id       = (known after apply)
      + log_type           = "SERVICE"
      + retention_duration = 7
      + state              = (known after apply)
      + tenancy_id         = (known after apply)
      + time_created       = (known after apply)
      + time_last_modified = (known after apply)

      + configuration {
          + compartment_id = (known after apply)

          + source {
              + category    = "access"
              + parameters  = (known after apply)
              + resource    = "ocid1.loadbalancer.oc1.ap-seoul-1.aaaaaaaatssba24t3l4kozqymaqhubbtif6sx65rdw4begr7nxwedmep46ga"
              + service     = "loadbalancer"
              + source_type = "OCISERVICE"
            }
        }
    }

  # oci_logging_log.load-balancer-error will be created
  + resource "oci_logging_log" "load-balancer-error" {
      + compartment_id     = (known after apply)
      + defined_tags       = (known after apply)
      + display_name       = "platform-log-load-balancer-error"
      + freeform_tags      = (known after apply)
      + id                 = (known after apply)
      + is_enabled         = (known after apply)
      + log_group_id       = (known after apply)
      + log_type           = "SERVICE"
      + retention_duration = 7
      + state              = (known after apply)
      + tenancy_id         = (known after apply)
      + time_created       = (known after apply)
      + time_last_modified = (known after apply)

      + configuration {
          + compartment_id = (known after apply)

          + source {
              + category    = "error"
              + parameters  = (known after apply)
              + resource    = "ocid1.loadbalancer.oc1.ap-seoul-1.aaaaaaaatssba24t3l4kozqymaqhubbtif6sx65rdw4begr7nxwedmep46ga"
              + service     = "loadbalancer"
              + source_type = "OCISERVICE"
            }
        }
    }

  # oci_logging_log.vcn will be created
  + resource "oci_logging_log" "vcn" {
      + compartment_id     = (known after apply)
      + defined_tags       = (known after apply)
      + display_name       = "platform-log-vcn"
      + freeform_tags      = (known after apply)
      + id                 = (known after apply)
      + is_enabled         = (known after apply)
      + log_group_id       = (known after apply)
      + log_type           = "SERVICE"
      + retention_duration = 7
      + state              = (known after apply)
      + tenancy_id         = (known after apply)
      + time_created       = (known after apply)
      + time_last_modified = (known after apply)

      + configuration {
          + compartment_id = (known after apply)

          + source {
              + category    = "all"
              + parameters  = (known after apply)
              + resource    = "ocid1.vcn.oc1.ap-seoul-1.amaaaaaabsyhd7qazvdwifpfgn75iw5yxheajr5ng4esmlikj23v7ee2ef3q"
              + service     = "flowlogs"
              + source_type = "OCISERVICE"
            }
        }
    }

  # oci_logging_log_group.main will be created
  + resource "oci_logging_log_group" "main" {
      + compartment_id     = "ocid1.compartment.oc1..aaaaaaaaxks7l2gcjjk3euzod7mzd22vc6bmczuqtto3f6z3aamcglgy2ujq"
      + defined_tags       = (known after apply)
      + description        = (known after apply)
      + display_name       = "platform-log-group-main"
      + freeform_tags      = (known after apply)
      + id                 = (known after apply)
      + state              = (known after apply)
      + time_created       = (known after apply)
      + time_last_modified = (known after apply)
    }

  # oci_monitoring_alarm.instance-cpu will be created
  + resource "oci_monitoring_alarm" "instance-cpu" {
      + alarm_summary                                 = (known after apply)
      + body                                          = (known after apply)
      + compartment_id                                = "ocid1.compartment.oc1..aaaaaaaaxks7l2gcjjk3euzod7mzd22vc6bmczuqtto3f6z3aamcglgy2ujq"
      + defined_tags                                  = (known after apply)
      + destinations                                  = (known after apply)
      + display_name                                  = "platform-alarm-cpu"
      + evaluation_slack_duration                     = (known after apply)
      + freeform_tags                                 = (known after apply)
      + id                                            = (known after apply)
      + is_enabled                                    = true
      + is_notifications_per_metric_dimension_enabled = (known after apply)
      + message_format                                = (known after apply)
      + metric_compartment_id                         = "ocid1.compartment.oc1..aaaaaaaaxks7l2gcjjk3euzod7mzd22vc6bmczuqtto3f6z3aamcglgy2ujq"
      + metric_compartment_id_in_subtree              = (known after apply)
      + namespace                                     = "oci_computeagent"
      + notification_title                            = (known after apply)
      + notification_version                          = (known after apply)
      + pending_duration                              = (known after apply)
      + query                                         = "cpuutilization[1m].max() > 40"
      + repeat_notification_duration                  = (known after apply)
      + resolution                                    = (known after apply)
      + resource_group                                = (known after apply)
      + rule_name                                     = (known after apply)
      + severity                                      = "CRITICAL"
      + state                                         = (known after apply)
      + time_created                                  = (known after apply)
      + time_updated                                  = (known after apply)

      + overrides (known after apply)

      + suppression (known after apply)
    }

  # oci_monitoring_alarm.instance-memory will be created
  + resource "oci_monitoring_alarm" "instance-memory" {
      + alarm_summary                                 = (known after apply)
      + body                                          = (known after apply)
      + compartment_id                                = "ocid1.compartment.oc1..aaaaaaaaxks7l2gcjjk3euzod7mzd22vc6bmczuqtto3f6z3aamcglgy2ujq"
      + defined_tags                                  = (known after apply)
      + destinations                                  = (known after apply)
      + display_name                                  = "platform-alarm-memory"
      + evaluation_slack_duration                     = (known after apply)
      + freeform_tags                                 = (known after apply)
      + id                                            = (known after apply)
      + is_enabled                                    = true
      + is_notifications_per_metric_dimension_enabled = (known after apply)
      + message_format                                = (known after apply)
      + metric_compartment_id                         = "ocid1.compartment.oc1..aaaaaaaaxks7l2gcjjk3euzod7mzd22vc6bmczuqtto3f6z3aamcglgy2ujq"
      + metric_compartment_id_in_subtree              = (known after apply)
      + namespace                                     = "oci_computeagent"
      + notification_title                            = (known after apply)
      + notification_version                          = (known after apply)
      + pending_duration                              = (known after apply)
      + query                                         = "MemoryUtilization[1m].max() > 70"
      + repeat_notification_duration                  = (known after apply)
      + resolution                                    = (known after apply)
      + resource_group                                = (known after apply)
      + rule_name                                     = (known after apply)
      + severity                                      = "CRITICAL"
      + state                                         = (known after apply)
      + time_created                                  = (known after apply)
      + time_updated                                  = (known after apply)

      + overrides (known after apply)

      + suppression (known after apply)
    }

  # oci_monitoring_alarm.load-balancer-bandwidth will be created
  + resource "oci_monitoring_alarm" "load-balancer-bandwidth" {
      + alarm_summary                                 = (known after apply)
      + body                                          = (known after apply)
      + compartment_id                                = "ocid1.compartment.oc1..aaaaaaaaxks7l2gcjjk3euzod7mzd22vc6bmczuqtto3f6z3aamcglgy2ujq"
      + defined_tags                                  = (known after apply)
      + destinations                                  = (known after apply)
      + display_name                                  = "platform-alarm-load-balancer-bandwidth"
      + evaluation_slack_duration                     = (known after apply)
      + freeform_tags                                 = (known after apply)
      + id                                            = (known after apply)
      + is_enabled                                    = true
      + is_notifications_per_metric_dimension_enabled = (known after apply)
      + message_format                                = (known after apply)
      + metric_compartment_id                         = "ocid1.compartment.oc1..aaaaaaaaxks7l2gcjjk3euzod7mzd22vc6bmczuqtto3f6z3aamcglgy2ujq"
      + metric_compartment_id_in_subtree              = (known after apply)
      + namespace                                     = "oci_lbaas"
      + notification_title                            = (known after apply)
      + notification_version                          = (known after apply)
      + pending_duration                              = (known after apply)
      + query                                         = "InboundBandwidthUsage[1m]{resourceId = "ocid1.loadbalancer.oc1.ap-seoul-1.aaaaaaaatssba24t3l4kozqymaqhubbtif6sx65rdw4begr7nxwedmep46ga"}.max() > 8"
      + repeat_notification_duration                  = (known after apply)
      + resolution                                    = (known after apply)
      + resource_group                                = (known after apply)
      + rule_name                                     = (known after apply)
      + severity                                      = "WARNING"
      + state                                         = (known after apply)
      + time_created                                  = (known after apply)
      + time_updated                                  = (known after apply)

      + overrides (known after apply)

      + suppression (known after apply)
    }

  # oci_ons_notification_topic.main will be created
  + resource "oci_ons_notification_topic" "main" {
      + api_endpoint   = (known after apply)
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaaxks7l2gcjjk3euzod7mzd22vc6bmczuqtto3f6z3aamcglgy2ujq"
      + defined_tags   = (known after apply)
      + description    = (known after apply)
      + etag           = (known after apply)
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + name           = "platform-notification-topic-main"
      + short_topic_id = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + topic_id       = (known after apply)
    }

  # oci_ons_subscription.email will be created
  + resource "oci_ons_subscription" "email" {
      + compartment_id  = "ocid1.compartment.oc1..aaaaaaaaxks7l2gcjjk3euzod7mzd22vc6bmczuqtto3f6z3aamcglgy2ujq"
      + created_time    = (known after apply)
      + defined_tags    = (known after apply)
      + delivery_policy = (known after apply)
      + etag            = (known after apply)
      + freeform_tags   = (known after apply)
      + id              = (known after apply)
      + protocol        = "EMAIL"
      + state           = (known after apply)
      + topic_id        = (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 11 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @ensia96, Action: `pull_request`*